Revit 2025 API
ControlledApplication.Cities Property
Returns a set of all the known city locations within Revit.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public CitySet Cities { get; }
Public ReadOnly Property Cities As CitySet
	Get
public:
property CitySet^ Cities {
	CitySet^ get ();
}
member Cities : CitySet with get
Property Value
CitySet
Remarks
Each city has information about longitude, latitude etc.
Example
// Get all Revit support cities
Autodesk.Revit.DB.CitySet cities = application.Cities;
// Set all Revit support cities into an ArrayList
System.Collections.ArrayList cityList = new System.Collections.ArrayList();
foreach (Autodesk.Revit.DB.City city in cities)
{
    cityList.Add(city);
}
' Get all Revit support cities
Dim cities As Autodesk.Revit.DB.CitySet = application.Cities
' Set all Revit support cities into an ArrayList
Dim cityList As New System.Collections.ArrayList()
For Each city As Autodesk.Revit.DB.City In cities
    cityList.Add(city)
Next
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace